import React, { useEffect, useRef, useState } from 'react';

export default function Boyvut() {

    const [scrollLeft, setScrollLeft] = useState(0);
    const tableRef = useRef(null);

    // Обработка скролла
    useEffect(() => {
        const handleScroll = () => {
            if (tableRef.current) {
                setScrollLeft(tableRef.current.scrollLeft);
            }
        };

        const tableElement = tableRef.current;
        if (tableElement) {
            tableElement.addEventListener('scroll', handleScroll);
        }

        return () => {
            if (tableElement) {
                tableElement.removeEventListener('scroll', handleScroll);
            }
        };
    }, []);

    const data = [
        {
            id: 1,
            name: 'Т.Латипов',
            vakil1: 'М.Темиров',
            vakil2: 'Туман Прокурори',
            values: [
                '68.4', '', '18.4', '27', '181.2', '', '', '9.0', '', '', '', '', '', '', '',
                '359.0', '', '319.0', '89', '13.0', '', '0.4', '3.1', '10.0', '',
                '7.1', '71.0', '6.0', '267.4', '6.0', '267.4', '100.0', '', '', '3.9', '',
                '3.8', '97.4', '', '', '', '', '1.0', '146.7', '', '', '', '-1.0',
                '-146.7', '2', '804.1', '', '0.0', '0.0', '-2', '-804', '6', '71.3', '',
                '', '', '-6', '-71', '3', '', '2', '-1'
            ]
        },
        {
            id: 2,
            name: 'А.Навоий',
            vakil1: 'А.Аллаёров',
            vakil2: 'Туман ҚХБ бошлиғининг \n биринчи ўринбосари',
            values: [
                '2.1', '', '2.1', '100', '395.6', '153.0', '242.6', '', '', '50.0', '',
                '', '', '', '', '456.0', '', '391.8', '86', '14.8', '', '1.0', '6.8',
                '15.0', '', '11.5', '76.6', '14.0', '292.3', '14.0', '292.3', '100.0',
                '', '', '3.5', '', '3.5', '100.0', '', '', '', '', '', '', '', '', '',
                '', '', '4', '714.5', '', '0.0', '0.0', '-4', '-714', '8', '312.9', '',
                '', '', '-8', '-313', '2', '', '2', ''
            ]
        },
        {
            id: 3,
            name: 'Наврўз',
            vakil1: 'А.Ишанқулов',
            vakil2: 'Туман Агро банк \n филиали бошқарувчиси',
            values: [
                '16.4', '', '', '', '303.6', '', '303.6', '', '', '39.0', '', '', '', '',
                '', '519.0', '', '368.6', '71', '23.0', '', '0.7', '3.0', '16.0', '',
                '10.7', '66.9', '12.0', '491.9', '12.0', '491.9', '100.0', '', '', '4.7',
                '', '3.5', '73.6', '2', '', '', '', '1.0', '53.6', '', '', '', '-1.0',
                '-53.6', '7', '985.4', '4', '245.5', '24.9', '-3', '-740', '12', '329.5',
                '', '', '', '-12', '-330', '', '', '', ''
            ]
        },
        {
            id: 4,
            name: 'Н.Махмудов',
            vakil1: 'С.Қаландаров',
            vakil2: 'Туман Ветиринария \n бўлими бошлиғи',
            values: [
                '', '', '', '', '378.9', '30.0', '348.9', '', '', '15.1', '', '', '', '',
                '', '463.9', '', '412.9', '89', '14.0', '', '0.3', '2.1', '19.0', '',
                '15.6', '82.1', '12.0', '408.1', '12.0', '408.1', '100.0', '', '', '4.1',
                '1.3', '4.1', '100.0', '', '', '', '', '2.0', '7.4', '1.0', '5.0', '',
                '-1.0', '-2.3', '7', '672.9', '6', '303.8', '45.2', '-1', '-369', '11',
                '371.5', '', '', '', '-11', '-371', '', '', '', ''
            ]
        },
        {
            id: 5,
            name: 'Тараққиёт',
            vakil1: 'Қ.Байзақов',
            vakil2: 'Туман Ўсимликлар ҳимояси ва \n карантини бўлим бошлиғи',
            values: [
                '135.6', '', '46.4', '34', '431.2', '153.4', '277.8', '', '', '', '', '',
                '', '', '', '719.9', '', '578.8', '80', '17.1', '', '0.4', '2.3',
                '20.0', '', '15.6', '78.0', '19.0', '488.9', '19.0', '488.9', '100.0',
                '', '', '6.4', '', '5.1', '80.0', '2', '', '', '', '3.0', '142.1', '1.0',
                '2.6', '', '-2.0', '-139.5', '10', '1493.9', '4', '164.7', '11.0', '-6',
                '-1329', '15', '332.1', '', '', '', '-15', '-332', '8', '', '6', '-2'
            ]
        },
        {
            id: 6,
            name: 'Дехқонобод',
            vakil1: 'С.Қаландаров',
            vakil2: 'Туман "Сув етказиб бериш \n хизмати" ДМ директори',
            values: [
                '14.0', '', '2.3', '16', '652.0', '153.0', '499.0', '327.0', '', '', '',
                '', '', '', '', '1479.0', '', '866.0', '59', '12.0', '', '0.5', '4.2',
                '25.0', '', '9.6', '38.4', '19.0', '529.0', '19.0', '529.0', '100.0', '',
                '', '7.9', '2.4', '5.7', '72.2', '3', '', '', '', '4.0', '120.6', '1.0',
                '18.8', '', '-3.0', '-101.8', '6', '1310.9', '1', '44.9', '3.4', '-5',
                '-1266', '10', '240.1', '', '', '', '-10', '-240', '2', '', '1', '-1'
            ]
        },
        {
            id: 7,
            name: 'Ш.Рашидов',
            vakil1: 'И.Туробов\nА.Вохидов',
            vakil2: 'Вилоят Агрохизматлар \n маркази директори\nАгросаноат ривожлантириш агентлиги \n туман бўлими бошлиғи',
            values: [
                '', '', '', '', '379.7', '', '379.7', '', '', '10.0', '', '', '', '', '',
                '437.8', '', '343.2', '78', '13.0', '', '0.5', '3.8', '23.0', '',
                '9.1', '39.6', '15.0', '325.0', '15.0', '343.1', '105.6', '', '', '3.6',
                '', '2.9', '80.6', '4', '', '', '', '2.0', '41.6', '', '', '', '-2.0',
                '-41.6', '6', '1285.8', '2', '98.0', '7.6', '-4', '-1188', '13', '226.4',
                '', '', '', '-13', '-226', '1', '', '', '-1'
            ]
        },
        {
            id: 8,
            name: '1-Боёвут',
            vakil1: 'Х.Тўйчиев\nБ.Холмухаммедов',
            vakil2: '“Гулистон нефт базаси” МЧЖ директори\nТуман Фермерлар кенгаши раиси',
            values: [
                '', '', '', '', '823.6', '248.0', '575.6', '', '', '40.0', '', '', '', '',
                '', '1127.0', '', '1010.5', '90', '35.6', '', '1.2', '3.4', '24.0',
                '', '16.5', '68.8', '34.0', '1559.0', '34.0', '1559.0', '100.0', '', '',
                '19.0', '', '16.0', '84.2', '5', '', '3.0', '60.0', '2.0', '97.5', '',
                '0.0', '', '-2.0', '-97.5', '10', '1320.5', '8', '435.7', '33.0', '-2',
                '-885', '18', '392.2', '', '', '', '-18', '-392', '1', '', '1', ''
            ]
        },
        {
            id: 9,
            name: 'У.Юсупов',
            vakil1: 'Ж.Тўраев',
            vakil2: 'Туман Агроинспекция \n бўлими бошлиғи',
            values: [
                '16.8', '', '2.3', '13', '1283.0', '435.0', '818.0', '', '', '110.0', '',
                '', '', '', '', '2071.0', '', '1702.9', '82', '27.6', '', '2.5', '9.1',
                '27.0', '', '22.2', '82.2', '26.0', '1041.4', '26.0', '1441.4', '138.4',
                '', '', '17.0', '', '9.0', '52.9', '4', '', '', '', '12.0', '578.6', '1.0',
                '20.8', '', '-11.0', '-557.8', '37', '7019.3', '18', '810.9', '11.6', '-19',
                '-6208', '42', '1223.8', '', '', '', '-42', '-1224', '2', '', '2', ''
            ]
        },
        {
            id: 10,
            name: '3-Боёвут',
            vakil1: 'Ў.Бегимов',
            vakil2: 'Туман ИИБ бошлиғи',
            values: [
                '', '', '', '', '2011.8', '', '2011.8', '', '', '14.5', '', '', '', '', '',
                '2072.7', '', '1839.4', '89', '20.5', '', '1.3', '6.3', '20.0', '',
                '19.0', '95.0', '52.0', '2774.0', '55.0', '2814.0', '101.4', '', '', '19.4',
                '4.2', '19.4', '100.0', '5', '', '5.0', '100', '', '', '', '', '', '', '',
                '17', '2590.6', '9', '255.0', '9.8', '-8', '-2336', '37', '1333.6', '',
                '', '', '-37', '-1334', '2', '', '', '-2'
            ]
        },
        {
            id: 11,
            name: 'Ғаллакор',
            vakil1: 'Д.Уралова',
            vakil2: 'Туман хокими',
            values: [
                '', '', '', '', '1884.5', '303.0', '1581.5', '', '25.0', '226.5', '', '',
                '', '', '', '2076.0', '', '1684.2', '81', '50.5', '', '3.8', '7.5',
                '19.0', '', '18.2', '95.8', '60.0', '2511.0', '60.0', '2511.0', '100.0',
                '', '', '19.7', '', '19.7', '100.0', '12', '', '12.0', '100', '', '', '',
                '', '', '', '', '11', '1055.4', '6', '274.9', '26.1', '-5', '-780',
                '31', '645.1', '', '', '', '-31', '-645', '2', '', '1', '-1'
            ]
        },
        {
            id: 12,
            name: 'Ғалаба',
            vakil1: 'З.Холиқбердиев',
            vakil2: 'Туман хокимининг ўринбосари',
            values: [
                '541.1', '', '260.2', '48', '1815.1', '1095.0', '720.1', '165.0', '', '',
                '', '', '', '', '', '3031.4', '', '2153.3', '71', '40.2', '', '9.3',
                '23.1', '16.0', '', '13.0', '81.1', '11.0', '280.9', '14.0', '333.9',
                '118.9', '', '', '7.4', '', '5', '60.8', '7', '', '', '', '1.0', '26.3',
                '', '', '', '-1.0', '-26.3', '7', '1546.0', '1', '63.8', '4.1', '-6',
                '-1482', '13', '440', '', '', '', '-13', '-440', '12', '', '3', '-9'
            ]
        },
        {
            id: 13,
            name: 'Навбаҳор',
            vakil1: 'И.Махатов',
            vakil2: 'Вилоят Ветеринария \n ва чорвачиликни \n ривожлантириш бошқармаси \n бошлиғи',
            values: [
                '1684.7', '', '168.8', '10', '960.1', '', '', '', '', '', '', '', '', '',
                '', '927.0', '', '531.4', '57', '35.7', '', '0.8', '2.2', '18.0', '',
                '7.3', '40.6', '24.0', '531.2', '27.0', '584.3', '110.0', '', '', '8.4',
                '', '5.1', '60.7', '3', '', '', '', '5.0', '189.4', '1.0', '1.1', '',
                '-4.0', '-188.3', '10', '1169.6', '3', '88.5', '7.6', '-7', '-1081',
                '20', '647', '', '', '', '-20', '-647', '44', '', '15', '-29'
            ]
        },
        {
            id: 14,
            name: 'Ширин',
            vakil1: '',
            vakil2: '',
            values: [
                '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '',
                '', '', '', '', '', '17.0', '', '2.9', '17.1', '', '', '9.0',
                '29.0', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '',
                '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', "", '',

            ]
        },
        {
            id: 14,
            name: 'Жами',
            vakil1: '',
            vakil2: '',
            values: [
                '2479', '', '501', '20', '11500', '2570', '7759', '501', '25', '505', '',
                '', '', '', '', '15740', '', '12202', '78', '317', '', '23', '7',
                '269', '', '178', '66', '304', '11500', '322', '12093', '105', '', '',
                '125', '8', '102', '82', '47', '', '20', '43', '33', '1404', '5', '48',
                '', '-28', '-1355', '134', '21969', '62', '2786', '13', '-72', '-19183',
                '236', '6566', '', '', '', '-236', '-6566', '79', '', '33', '-46'
            ]
        }
    ];

    return (
        <div className="grid-container" dir="ltr">
            <div className="table-scroll-wrapper" ref={tableRef}>
                <table className="waffle" cellSpacing="0" cellPadding="0">
                    <thead>
                        {/* Первая строка заголовков */}
                        <tr style={{ height: '20px' }}>
                            <td className="s0 sticky-col col1" rowSpan="3" style={{ left: '0px' }}>Т/р</td>
                            <td className="s0 sticky-col col2" rowSpan="3" style={{ left: '23px' }}>Худудлар номи</td>
                            <td className="s0 sticky-col col3" colSpan="2" rowSpan="3" style={{ left: '140px' }}>Бириктирилган вакил</td>
                            <td className="s1" colSpan="4">Ер ўзлаштириш</td>
                            <td className="s1" colSpan="11">Шинжон усулида томчилатиб</td>
                            <td className="s1" colSpan="4">Кузги шудгорлаш</td>
                            <td className="s1" colSpan="4">Ички ариқларни бетонлаштириш</td>
                            <td className="s1" colSpan="4">Ариқларни тозалаш <br /> (қўл кучида)</td>
                            <td className="s1" colSpan="7">Ғаллани суғориш <br /> 1-сув</td>
                            <td className="s1" colSpan="4">Пилла шртномасини тузиш</td>
                            <td className="s1" colSpan="4">Насосларга қуёш панели ўрнатиш</td>
                            <td className="s1" colSpan="7">Ғалла кредетидан қарздорлиги млн.сўм</td>
                            <td className="s1" colSpan="7">Пахта кредетидан қарздорлиги млн.сўм</td>
                            <td className="s1" colSpan="7">Сув солиғидан қарздорлик млн.сўм</td>
                            <td className="s1" colSpan="4">Судга бериш</td>
                        </tr>

                        {/* Вторая строка заголовков */}
                        <tr style={{ height: '20px' }}>
                            <td className="s0" rowSpan="2">Режа</td>
                            <td className="s0" colSpan="2">Амалда</td>
                            <td className="s0" rowSpan="2">Фоиз</td>
                            <td className="s0" rowSpan="2">Жами 2026 йил шинжон</td>
                            <td className="s0" rowSpan="2">2025 йилгача қилинган</td>
                            <td className="s0" rowSpan="2">2026 йилда режа</td>
                            <td className="s0" rowSpan="2">Ўз ҳисобидан қилина-диган майдон</td>
                            <td className="s0" colSpan="2">Сув кредитга ариза юбориш</td>
                            <td className="s0" colSpan="2">Молиялаш-тириш</td>
                            <td className="s0" colSpan="2">Амалда ишга туширилди</td>
                            <td className="s0" rowSpan="2">Фоиз</td>
                            <td className="s0" rowSpan="2">Режа</td>
                            <td className="s0" colSpan="2">Амалда</td>
                            <td className="s0" rowSpan="2">Фоиз</td>
                            <td className="s0" rowSpan="2">Режа</td>
                            <td className="s0" colSpan="2">Амалда</td>
                            <td className="s0" rowSpan="2">Фоиз</td>
                            <td className="s0" rowSpan="2">Режа</td>
                            <td className="s0" colSpan="2">Амалда</td>
                            <td className="s0" rowSpan="2">Фоиз</td>
                            <td className="s0" colSpan="2">Режа</td>
                            <td className="s0" colSpan="2">Амалда</td>
                            <td className="s0" rowSpan="2">%</td>
                            <td className="s0" colSpan="2">Фарқи,<br /> +,-</td>
                            <td className="s0" rowSpan="2">Режа</td>
                            <td className="s0" colSpan="2">Амалда</td>
                            <td className="s0" rowSpan="2">Фоиз</td>
                            <td className="s0" rowSpan="2">Режа</td>
                            <td className="s0" colSpan="2">Амалда</td>
                            <td className="s0" rowSpan="2">Фоиз</td>
                            <td className="s0" colSpan="2">Мавжуд қарздор-<br />лик</td>
                            <td className="s0" colSpan="2">Амалда сўндирилди</td>
                            <td className="s0" rowSpan="2">Фоиз</td>
                            <td className="s0" colSpan="2">Қолдиқ,<br /> +,-</td>
                            <td className="s0" colSpan="2">Мавжуд қарздор-<br />лик</td>
                            <td className="s0" colSpan="2">Амалда сўндирилди</td>
                            <td className="s0" rowSpan="2">Фоиз</td>
                            <td className="s0" colSpan="2">Қолдиқ,<br /> +,-</td>
                            <td className="s0" colSpan="2">Мавжуд</td>
                            <td className="s0" colSpan="2">Амалда тўланди</td>
                            <td className="s0" rowSpan="2">Фоиз</td>
                            <td className="s0" colSpan="2">Қолдиқ,<br /> +,-</td>
                            <td className="s0" rowSpan="2">Режа</td>
                            <td className="s0" rowSpan="2">Судга хужжат берилди</td>
                            <td className="s0" rowSpan="2">Суд қарори чиқа-рилди</td>
                            <td className="s0" rowSpan="2">Фарқи,<br /> +,-</td>
                        </tr>

                        {/* Третья строка заголовков */}
                        <tr style={{ height: '20px' }}>
                            <td className="s0">Бир кунда</td>
                            <td className="s0">Мавсум боши</td>
                            <td className="s0">Бир кунда</td>
                            <td className="s0">Мавсум боши</td>
                            <td className="s0">Бир кунда</td>
                            <td className="s0">Мавсум боши</td>
                            <td className="s0">Бир кунда</td>
                            <td className="s0">Мавсум боши</td>
                            <td className="s0">Бир <br /> кунда</td>
                            <td className="s0">Мавсум боши</td>
                            <td className="s0">Бир <br /> кунда</td>
                            <td className="s0">Мавсум боши</td>
                            <td className="s0">Бир <br /> кунда</td>
                            <td className="s0">Мавсум боши</td>
                            <td className="s0">ф/х <br /> сони</td>
                            <td className="s0">га</td>
                            <td className="s0">ф/х <br /> сони</td>
                            <td className="s0">га</td>
                            <td className="s0">ф/х <br /> сони</td>
                            <td className="s0">га</td>
                            <td className="s0">Бир кунда</td>
                            <td className="s0">Мавсум боши</td>
                            <td className="s0">Бир <br /> кунда</td>
                            <td className="s0">Мавсум боши</td>
                            <td className="s0">ф/х <br /> сони</td>
                            <td className="s0">сумма</td>
                            <td className="s0">ф/х <br /> сони</td>
                            <td className="s0">сумма</td>
                            <td className="s0">ф/х <br /> сони</td>
                            <td className="s0">сумма</td>
                            <td className="s0">ф/х <br /> сони</td>
                            <td className="s0">сумма</td>
                            <td className="s0">ф/х <br /> сони</td>
                            <td className="s0">сумма</td>
                            <td className="s0">ф/х <br /> сони</td>
                            <td className="s0">сумма</td>
                            <td className="s0">ф/х <br /> сони</td>
                            <td className="s0">сумма</td>
                            <td className="s0">ф/х <br /> сони</td>
                            <td className="s0">сумма</td>
                            <td className="s0">ф/х сони</td>
                            <td className="s0">сумма</td>
                        </tr>
                    </thead>

                    <tbody>
                        {data.map((row, rowIndex) => (
                            <tr key={rowIndex} style={{ height: '20px' }}>
                                <td
                                    className={`${row.id === 14 && rowIndex === data.length - 1 ? "s0" : "s2"} sticky-col col1`}
                                    style={{ left: '0px' }}
                                >
                                    {row.id}
                                </td>
                                <td
                                    className={`${row.id === 14 && rowIndex === data.length - 1 ? "s0" : "s3"} sticky-col col2`}
                                    style={{ left: '23px' }}
                                >
                                    {row.name}
                                </td>
                                <td
                                    className={`${row.id === 14 && rowIndex === data.length - 1 ? "s6" : "s3"} sticky-col col3`}
                                    style={{ left: '130px' }}
                                >
                                    {row.vakil1.includes('\n') ? (
                                        <>
                                            {row.vakil1.split('\n').map((line, i) => (
                                                <React.Fragment key={i}>
                                                    {line}
                                                    {i < row.vakil1.split('\n').length - 1 && <br />}
                                                </React.Fragment>
                                            ))}
                                        </>
                                    ) : (
                                        row.vakil1
                                    )}
                                </td>
                                <td
                                    className={`${row.id === 14 && rowIndex === data.length - 1 ? "s6" : "s3"} sticky-col col4`}
                                    style={{ left: '240px' }}
                                >
                                    {row.vakil2.includes('\n') ? (
                                        <>
                                            {row.vakil2.split('\n').map((line, i) => (
                                                <React.Fragment key={i}>
                                                    {line}
                                                    {i < row.vakil2.split('\n').length - 1 && <br />}
                                                </React.Fragment>
                                            ))}
                                        </>
                                    ) : (
                                        row.vakil2
                                    )}
                                </td>
                                {row.values.map((value, index) => (
                                    <td
                                        key={index}
                                        className={
                                            row.id === 14 && rowIndex === data.length - 1
                                                ? index < 30 ? "s0" : "s0"
                                                : index < 30 ? "" : ""
                                        }
                                    >
                                        {value}
                                    </td>
                                ))}
                            </tr>
                        ))}
                    </tbody>
                </table>
            </div>
        </div>
    );
}