
import React, { useEffect, useRef, useState } from 'react';

export default function Gulistan() {

    const [scrollLeft, setScrollLeft] = useState(0);
    const tableRef = useRef(null);

    // Обработка скролла
    useEffect(() => {
        const handleScroll = () => {
            if (tableRef.current) {
                setScrollLeft(tableRef.current.scrollLeft);
            }
        };

        const tableElement = tableRef.current;
        if (tableElement) {
            tableElement.addEventListener('scroll', handleScroll);
        }

        return () => {
            if (tableElement) {
                tableElement.removeEventListener('scroll', handleScroll);
            }
        };
    }, []);
    const data = [
        {
            id: 1,
            name: 'Боёвут СИУ',
            vakil1: 'Ф.Муқимов',
            vakil2: 'Туман Фермер\n кенгаши раиси',
            values: [
                '174', '', '11', '6', '295', '', '295', '', '', '', '', '', '', '', '', '525', '', '437', '83', '12', '', '0.6', '5', '29', '', '12.1', '41', '34', '897', '34', '976', '109', '', '79', '30', '9', '21', '6', '67', '-9', '-3', '7', '', '3', '43', '6', '405', '1', '16', '4', '-5', '-390', '9', '1,31', '7', '410', '31', '-2', '-900', '25', '957', '3', '31', '3', '-22', '-925', '2', '', '', '-2'
            ]
        },
        {
            id: 2,
            name: 'Уч Кахрамон СИУ',
            vakil1: 'Б.Кадиров',
            vakil2: '“Дўстлик” канали\n бошқармаси бошлиғи',
            values: [
                '55', '', '', '', '571', '26', '545', '47', '', '10', '', '', '', '', '', '824', '', '679', '82', '25', '', '1.9', '8', '34', '', '20.5', '60', '38', '870', '38', '884', '102', '', '15', '30', '11', '18', '7', '61', '-12', '-4', '3', '', '', '', '3', '235', '', '', '', '-3', '-235', '15', '1,711', '16', '412', '24', '1', '-1,299', '41', '797', '9', '81', '10', '-32', '-716', '4', '', '', '-4'
            ]
        },
        {
            id: 3,
            name: 'Ўзбекистон СИУ',
            vakil1: 'Т.Абдуллаев',
            vakil2: 'Туман Мелиорация\n бўлими бошлиғи',
            values: [
                '', '', '', '', '116', '', '116', '84', '', '', '', '', '', '', '', '350', '', '284', '81', '7', '', '0.6', '8', '15', '', '11.6', '78', '17', '425', '17', '387', '91', '', '-37', '11', '5', '6', '3', '59', '-5', '-2', '2', '', '', '', '', '', '', '', '', '', '', '1', '64', '1', '3', '5', '', '-60', '9', '166', '2', '5', '3', '-7', '-161', '2', '', '', '-2'
            ]
        },
        {
            id: 4,
            name: 'Пахтаобод СИУ',
            vakil1: 'Д.Хайитқулов',
            vakil2: 'Туман Ўсимликлар ҳимояси\n ва карантини бўлим бошлиғи',
            values: [
                '116', '', '55', '48', '366', '115', '251', '104', '', '', '', '', '', '', '', '561', '', '476', '85', '21', '', '1.8', '8', '16', '', '12.3', '77', '28', '548', '28', '603', '110', '', '55', '28', '8', '19', '5', '67', '-9', '-3', '2', '', '', '', '7', '457', '', '', '', '-7', '-457', '8', '3,012', '7', '309', '10', '-1', '-2,703', '23', '216', '3', '4', '2', '-20', '-211', '7', '1', '', '-7'
            ]
        },
        {
            id: 5,
            name: 'Бешбулок СИУ',
            vakil1: 'З.Бабаханов',
            vakil2: 'Туман ИИБ бошлиғи',
            values: [
                '105', '', '39', '37', '791', '66', '725', '24', '', '', '', '', '', '', '', '1,067', '6', '990', '93', '31', '', '4.2', '13', '28', '', '19.6', '70', '57', '942', '57', '1,014', '108', '', '71', '34', '13', '24', '9', '68', '-10', '-4', '19', '', '9', '47', '6', '95', '', '', '', '-6', '-95', '12', '2,566', '8', '346', '13', '-4', '-2,221', '46', '750', '12', '86', '11', '-34', '-665', '9', '2', '1', '-8'
            ]
        },
        {
            id: 6,
            name: 'Саховат СИУ',
            vakil1: 'Ш.Каримқулов',
            vakil2: 'Туман Агроинспекция\n бўлими бошлиғи',
            values: [
                '', '', '', '', '240', '40', '200', '45', '', '15', '', '', '', '', '', '483', '', '393', '81', '5', '', '0.7', '14', '18', '', '10.0', '56', '10', '197', '10', '210', '107', '', '13', '11', '5', '8', '4', '76', '-3', '-1', '3', '', '', '', '2', '187', '', '', '', '-2', '-187', '10', '1,352', '6', '208', '15', '-4', '-1,144', '13', '213', '2', '30', '14', '-11', '-183', '1', '1', '', '-1'
            ]
        },
        {
            id: 7,
            name: 'Нурли йўл СИУ',
            vakil1: 'А.Мухамедов',
            vakil2: 'Туман "Сув етказиб\n бериш хизмати" ДМ директори',
            values: [
                '', '', '', '', '559', '23', '536', '51', '', '11', '', '', '', '', '', '688', '5', '543', '79', '30', '', '3.1', '10', '20', '', '14.1', '71', '22', '414', '22', '396', '96', '', '-18', '26', '7', '18', '5', '69', '-8', '-2', '', '', '', '', '1', '28', '', '', '', '-1', '-28', '8', '2,112', '1', '438', '21', '-7', '-1,675', '18', '312', '8', '76', '24', '-10', '-236', '1', '1', '', '-1'
            ]
        },
        {
            id: 8,
            name: 'Юксалиш СИУ',
            vakil1: 'С.Ўтбосаров',
            vakil2: 'Туман ҳокимининг ўринбосари',
            values: [
                '14', '', '', '', '1,033', '51', '982', '137', '', '', '', '', '', '', '', '1,424', '26', '1,284', '90', '39', '', '3.8', '10', '39', '', '31.4', '80', '32', '767', '32', '706', '92', '', '-61', '35', '14', '22', '9', '61', '-13', '-5', '5', '', '1', '20', '5', '460', '', '', '', '-5', '-460', '12', '1,632', '5', '282', '17', '-7', '-1,351', '31', '527', '5', '35', '7', '-26', '-492', '4', '', '', '-4'
            ]
        },
        {
            id: 9,
            name: 'Дустлик СИУ',
            vakil1: 'Д.Сангиров',
            vakil2: 'Туман Прокурори',
            values: [
                '75', '', '36', '48', '862', '', '862', '329', '', '7', '', '', '', '', '', '1,215', '18', '1,144', '94', '19', '', '2.6', '14', '37', '', '29.2', '79', '43', '868', '43', '862', '99', '', '-6', '35', '14', '22', '8', '62', '-13', '-5', '8', '', '2', '25', '11', '702', '', '', '', '-11', '-702', '17', '3,04', '10', '294', '10', '-7', '-2,746', '37', '964', '6', '68', '7', '-31', '-896', '7', '4', '', '-7'
            ]
        },
        {
            id: 10,
            name: 'Боғишамол СИУ',
            vakil1: 'Ф.Йўлдошов',
            vakil2: 'Туман Ветеринария\n бўлими бошлиғи',
            values: [
                '40', '', '', '', '1,29', '', '1,29', '490', '', '', '', '', '', '', '', '1,569', '11', '1,163', '74', '43', '', '1.4', '3', '27', '', '29.8', '110', '33', '492', '32', '522', '106', '-1', '31', '31', '13', '20', '8', '63', '-11', '-5', '6', '', '', '', '3', '111', '', '', '', '-3', '-111', '9', '1,321', '3', '155', '12', '-6', '-1,167', '31', '281', '9', '46', '16', '-22', '-235', '5', '', '', '-5'
            ]
        },
        {
            id: 11,
            name: 'Хосилобод СИУ',
            vakil1: 'О.Джураев',
            vakil2: 'Туман ҳокими',
            values: [
                '4', '', '4', '100', '619', '11', '608', '98', '', '', '', '', '', '', '', '896', '', '888', '99', '34', '', '3.1', '9', '30', '', '22.9', '76', '34', '661', '31', '597', '90', '-3', '-63', '31', '10', '23', '7', '73', '-8', '-3', '3', '', '', '', '4', '129', '', '', '', '-4', '-129', '10', '2,262', '8', '296', '13', '-2', '-1,967', '24', '566', '7', '77', '14', '-17', '-489', '4', '1', '', '-4'
            ]
        },
        {
            id: 12,
            name: 'Ишонч СИУ',
            vakil1: 'Б.Абдураимов',
            vakil2: 'Туман Агро банк\n филиали бошқарувчиси',
            values: [
                '', '', '', '', '557', '', '557', '', '', '', '', '', '', '', '', '751', '5', '586', '78', '14', '', '0.9', '6', '15', '', '8.0', '54', '6', '110', '6', '143', '131', '', '34', '5', '5', '3', '4', '69', '-2', '-2', '2', '', '', '', '1', '57', '', '', '', '-1', '-57', '2', '452', '', '', '', '-2', '-452', '4', '203', '3', '125', '62', '-1', '-77', '', '', '', ''
            ]
        },
        {
            id: 13,
            name: 'Янги хаёт СИУ',
            vakil1: 'А.Қултоев',
            vakil2: 'Агросаноатни ривожлантириш\n вилоят бўлими бошлиғи',
            values: [
                '', '', '', '', '477', '', '477', '35', '', '42', '', '', '', '', '', '544', '10', '464', '85', '20', '', '0.8', '4', '12', '', '5.0', '42', '13', '215', '13', '215', '100', '', '', '8', '5', '5', '3', '68', '-3', '-2', '2', '', '', '', '1', '101', '', '', '', '-1', '-101', '3', '464', '', '', '', '-3', '-464', '11', '518', '4', '9', '2', '-7', '-509', '2', '', '', '-2'
            ]
        },
        {
            id: 14,
            name: 'Истиқлол СИУ',
            vakil1: 'А.Машрабов',
            vakil2: 'Туман ДСИ бошлиғи',
            values: [
                '6', '', '', '', '190', '', '190', '', '', '15', '', '', '', '', '', '340', '', '306', '90', '10', '', '1.0', '11', '6', '', '4.8', '80', '11', '270', '10', '156', '58', '-1', '-114', '5', '4', '4', '3', '75', '-1', '-1', '2', '', '1', '50', '1', '1', '', '', '', '-1', '-1', '4', '984', '3', '89', '9', '-1', '-895', '6', '147', '', '', '', '-6', '-147', '6', '', '', '-6'
            ]
        }
        ,
        {
            id: 15,
            name: 'Бошқа хўжаликлар',
            vakil1: '',
            vakil2: '',
            values: [
                '', '', '', '', '35', '', '35', '', '', '', '', '', '', '', '', '103', '', '93', '90', '', '', '', '', '', '', '', '', '1', '92', '1', '58', '63', '', '-34', '2', '2', '1', '1', '32', '-1', '-2', '', '', '', '', '', '', '', '', '', '', '', '1', '353', '1', '353', '100', '', '', '', '', '', '', '', '', '', '', '', '', '', 
            ]
        },
        {
            id: 0,
            name: 'Туман жами',
            vakil1: '',
            vakil2: '',
            values: [
                '589', '', '144', '25', '8', '332', '7,668', '1,442', '', '99', '', '', '', '', '',
                '11,34', '81', '9,73', '86', '311', '', '26', '8', '326', '', '231', '71', '379',
                '7,766', '374', '7,73', '100', '-5', '-36', '322', '124', '213', '81', '65',
                '-109', '-43', '64', '', '16', '25', '51', '2,969', '1', '16', '1', '-50',
                '-2,953', '121', '22,637', '76', '3,594', '16', '-45', '-19,043', '319',
                '6,616', '73', '673', '10', '-246', '-5,943', '54', '10', '1', '-53'
            ]
        }

    ];

    return (
        <div className="grid-container" dir="ltr">
            <div className="table-scroll-wrapper">
                <table className="waffle" cellSpacing="0" cellPadding="0">
                    <thead>
                        {/* Первая строка заголовков */}
                        <tr style={{ height: '20px' }}>
                            <td className="s0 sticky-col col1" rowSpan="3" style={{ left: '0px' }}>Т/р</td>
                            <td className="s0 sticky-col col2" rowSpan="3" style={{ left: '48px' }}>Худудлар номи</td>
                            <td className="s0 sticky-col col3" colSpan="2" rowSpan="3" style={{ left: '165px' }}>Бириктирилган вакил</td>
                            <td className="s1" colSpan="4">Ер ўзлаштириш</td>
                            <td className="s1" colSpan="11">Шинжон усулида томчилатиб</td>
                            <td className="s1" colSpan="4">Кузги шудгорлаш</td>
                            <td className="s1" colSpan="4">Ички ариқларни бетонлаштириш</td>
                            <td className="s1" colSpan="4">Ариқларни тозалаш <br /> (қўл кучида)</td>
                            <td className="s1" colSpan="7">Ғаллани суғориш <br /> 1-сув</td>
                            <td className="s1" colSpan="7">Пилла шртномасини тузиш</td>
                            <td className="s1" colSpan="4">Насосларга қуёш панели ўрнатиш</td>
                            <td className="s1" colSpan="7">Ғалла кредетидан қарздорлиги млн.сўм</td>
                            <td className="s1" colSpan="7">Пахта кредетидан қарздорлиги млн.сўм</td>
                            <td className="s1" colSpan="7">Сув солиғидан қарздорлик млн.сўм</td>
                            <td className="s1" colSpan="4">Судга бериш</td>
                        </tr>

                        {/* Вторая строка заголовков */}
                        <tr style={{ height: '20px' }}>
                            <td className="s0 !w-[200px]" rowSpan="2">Режа</td>
                            <td className="s0" colSpan="2">Амалда</td>
                            <td className="s0" rowSpan="2">Фоиз</td>
                            <td className="s0" rowSpan="2">Жами 2026 йил шинжон</td>
                            <td className="s0" rowSpan="2">2025 йилгача қилинган</td>
                            <td className="s0" rowSpan="2">2026 йилда режа</td>
                            <td className="s0" rowSpan="2">Ўз ҳисобидан қилина-диган майдон</td>
                            <td className="s0" colSpan="2">Сув кредитга ариза юбориш</td>
                            <td className="s0" colSpan="2">Молиялаш-тириш</td>
                            <td className="s0" colSpan="2">Амалда ишга туширилди</td>
                            <td className="s0" rowSpan="2">Фоиз</td>
                            <td className="s0" rowSpan="2">Режа</td>
                            <td className="s0" colSpan="2">Амалда</td>
                            <td className="s0" rowSpan="2">Фоиз</td>
                            <td className="s0" rowSpan="2">Режа</td>
                            <td className="s0" colSpan="2">Амалда</td>
                            <td className="s0" rowSpan="2">Фоиз</td>
                            <td className="s0" rowSpan="2">Режа</td>
                            <td className="s0" colSpan="2">Амалда</td>
                            <td className="s0" rowSpan="2">Фоиз</td>
                            <td className="s0" colSpan="2">Режа</td>
                            <td className="s0" colSpan="2">Амалда</td>
                            <td className="s0" rowSpan="2">%</td>
                            <td className="s0" colSpan="2">Фарқи,<br /> +,-</td>
                            <td className="s0" colSpan="2">Режа</td>
                            <td className="s0" colSpan="2">Амалда</td>
                            <td className="s0" rowSpan="2">%</td>
                            <td className="s0" colSpan="2">Фарқи,<br /> +,-</td>
                            <td className="s0" rowSpan="2">Режа</td>
                            <td className="s0" colSpan="2">Амалда</td>
                            <td className="s0" rowSpan="2">Фоиз</td>
                            <td className="s0" colSpan="2">Мавжуд қарздор-<br />лик</td>
                            <td className="s0" colSpan="2">Амалда сўндирилди</td>
                            <td className="s0" rowSpan="2">Фоиз</td>
                            <td className="s0" colSpan="2">Қолдиқ,<br /> +,-</td>
                            <td className="s0" colSpan="2">Мавжуд қарздор-<br />лик</td>
                            <td className="s0" colSpan="2">Амалда сўндирилди</td>
                            <td className="s0" rowSpan="2">Фоиз</td>
                            <td className="s0" colSpan="2">Қолдиқ,<br /> +,-</td>
                            <td className="s0" colSpan="2">Мавжуд</td>
                            <td className="s0" colSpan="2">Амалда тўланди</td>
                            <td className="s0" rowSpan="2">Фоиз</td>
                            <td className="s0" colSpan="2">Қолдиқ,<br /> +,-</td>
                            <td className="s0" rowSpan="2">Режа</td>
                            <td className="s0" rowSpan="2">Судга хужжат берилди</td>
                            <td className="s0" rowSpan="2">Суд қарори чиқа-рилди</td>
                            <td className="s0" rowSpan="2">Фарқи,<br /> +,-</td>
                        </tr>

                        {/* Третья строка заголовков */}
                        <tr style={{ height: '20px' }}>
                            <td className="s0">Бир кунда</td>
                            <td className="s0">Мавсум боши</td>
                            <td className="s0">Бир кунда</td>
                            <td className="s0">Мавсум боши</td>
                            <td className="s0">Бир кунда</td>
                            <td className="s0">Мавсум боши</td>
                            <td className="s0">Бир кунда</td>
                            <td className="s0">Мавсум боши</td>
                            <td className="s0">Бир <br /> кунда</td>
                            <td className="s0">Мавсум боши</td>
                            <td className="s0">Бир <br /> кунда</td>
                            <td className="s0">Мавсум боши</td>
                            <td className="s0">Бир <br /> кунда</td>
                            <td className="s0">Мавсум боши</td>
                            <td className="s0">ф/х <br /> сони</td>
                            <td className="s0">га</td>
                            <td className="s0">ф/х <br /> сони</td>
                            <td className="s0">га</td>
                            <td className="s0">ф/х <br /> сони</td>
                            <td className="s0">га</td>
                            <td className="s0">ф/х <br /> сони</td>
                            <td className="s0">тн</td>
                            <td className="s0">ф/х <br /> сони</td>
                            <td className="s0">тн</td>
                            <td className="s0">ф/х <br /> сони</td>
                            <td className="s0">тн</td>
                            <td className="s0">Бир кунда</td>
                            <td className="s0">Мавсум боши</td>
                            <td className="s0">Бир <br /> кунда</td>
                            <td className="s0">Мавсум боши</td>
                            <td className="s0">ф/х <br /> сони</td>
                            <td className="s0">сумма</td>
                            <td className="s0">ф/х <br /> сони</td>
                            <td className="s0">сумма</td>
                            <td className="s0">ф/х <br /> сони</td>
                            <td className="s0">сумма</td>
                            <td className="s0">ф/х <br /> сони</td>
                            <td className="s0">сумма</td>
                            <td className="s0">ф/х <br /> сони</td>
                            <td className="s0">сумма</td>
                            <td className="s0">ф/х <br /> сони</td>
                            <td className="s0">сумма</td>
                            <td className="s0">ф/х <br /> сони</td>
                            <td className="s0">сумма</td>
                            <td className="s0">ф/х <br /> сони</td>
                            <td className="s0">сумма</td>

                        </tr>
                    </thead>

                    <tbody>
                        {data.map((row, rowIndex) => (
                            <tr key={rowIndex} style={{ height: '20px' }}>
                                <td
                                    className={`${row.id === 14 && rowIndex === data.length - 1 ? "s0" : "s2"} sticky-col col1`}
                                    style={{ left: '0px' }}

                                >
                                    {row.id}
                                </td>
                                <td
                                    className={`${row.id === 14 && rowIndex === data.length - 1 ? "s0" : "s3"} sticky-col col2`}
                                    style={{ left: '48px' }}

                                >
                                    {row.name}
                                </td>
                                <td
                                    className={`${row.id === 14 && rowIndex === data.length - 1 ? "s6" : "s3"} sticky-col col3`}
                                    style={{ left: '165px' }}

                                >
                                    {row.vakil1.includes('\n') ? (
                                        <>
                                            {row.vakil1.split('\n').map((line, i) => (
                                                <React.Fragment key={i}>
                                                    {line}
                                                    {i < row.vakil1.split('\n').length - 1 && <br />}
                                                </React.Fragment>
                                            ))}
                                        </>
                                    ) : (
                                        row.vakil1
                                    )}
                                </td>
                                <td
                                    className={`${row.id === 14 && rowIndex === data.length - 1 ? "s6" : "s3"} sticky-col col4`}
                                    style={{ left: '280px' }}

                                >
                                    {row.vakil2.includes('\n') ? (
                                        <>
                                            {row.vakil2.split('\n').map((line, i) => (
                                                <React.Fragment key={i}>
                                                    {line}
                                                    {i < row.vakil2.split('\n').length - 1 && <br />}
                                                </React.Fragment>
                                            ))}
                                        </>
                                    ) : (
                                        row.vakil2
                                    )}
                                </td>
                                {row.values.map((value, index) => (
                                    <td
                                        key={index}
                                        className={
                                            row.id === 14 && rowIndex === data.length - 1
                                                ? "s0"
                                                : "s2"
                                        }
                                    >
                                        {value}
                                    </td>
                                ))}
                            </tr>
                        ))}
                    </tbody>
                </table>
            </div>
        </div>
    );
}
