
import React, { useEffect, useRef, useState } from 'react';

export default function Gulistan() {

    const [scrollLeft, setScrollLeft] = useState(0);
    const tableRef = useRef(null);

    // Обработка скролла
    useEffect(() => {
        const handleScroll = () => {
            if (tableRef.current) {
                setScrollLeft(tableRef.current.scrollLeft);
            }
        };

        const tableElement = tableRef.current;
        if (tableElement) {
            tableElement.addEventListener('scroll', handleScroll);
        }

        return () => {
            if (tableElement) {
                tableElement.removeEventListener('scroll', handleScroll);
            }
        };
    }, []);
    const data = [
        {
            id: 1,
            name: 'Боёвут СИУ',
            vakil1: 'Ф.Муқимов',
            vakil2: 'Туман Фермер кенгаши раиси',
            values: [
                '174', '', '11', '6', '295', '', '295', '', '', '', '', '', '', '', '',
                , '525', '4', '437', '83', '12', '', '0.6', '5', '29', '', '12.0',
                '41', '33', '897', '33', '976', '109', '', '', ,
                '5', '57', '-18', '-4', '7', '', '3', '43', '6', '405', '1', '16',
                '4', '-5', '-390', '9', '1,31', '7', '156', '12', '-2', '-1,154',
                '25', '957', '2', '49', '5', '-23', '-908', '6', '1', '', '-6'
            ]
        },
        {
            id: 2,
            name: 'Уч Кахрамон СИУ',
            vakil1: 'Б.Кадиров',
            vakil2: '“Дўстлик” канали бошқармаси бошлиғи',
            values: [
                '55', '', '', '', '571', '26', '545', '47', '', '10', '', '', '', '', '', '824', '4', '679', '82', '25', '', '1.9', '8', '34', '', '10.0',
                '29', '35', '870', '35', '880', '101', '', '',
                '6', '53', '-8', '-5', '3', '', '', '', '3', '235', '', '', '', '-3',
                '-235', '15', '1,711', '15', '402', '23', '', '-1,309', '41', '797',
                '3', '81', '10', '-38', '-716', '5', '', '1', '-4'
            ]
        },
        {
            id: 3,
            name: 'Ўзбекистон СИУ',
            vakil1: 'Т.Абдуллаев',
            vakil2: 'Туман Мелиорация бўлими бошлиғи',
            values: [
                '', '', '', '', '116', '', '116', '84', '', '', '', '', '', '', '',
                '350', '2', '284', '81', '7', '', '0.6', '8', '15', '', '11.6',
                '77', '17', '425', '17', '387', '91', '', '-37', , '2',
                '50', '-5', '-3', '2', '', '', '', '', '', '', '', '', '', '', '1',
                '64', '1', '3', '5', '', '-60', '9', '166', '', '', '', '-9', '-166',
                '3', '', '', '-3'
            ]
        },
        {
            id: 4,
            name: 'Пахтаобод СИУ',
            vakil1: 'Д.Хайитқулов',
            vakil2: 'Туман Ўсимликлар ҳимояси ва карантини бўлим бошлиғи',
            values: [
                '116', '', '55', '48', '366', '115', '251', '104', '', '', '', '', '', '', '',
                '561', '', '476', '85', '21', '', '1.8', '8', '16', '', '12.2',
                '76', '25', '548', '25', '603', '110', '', '55', '4',
                '48', '-20', '-4', '2', '', '', '', '7', '457', '', '', '', '-7',
                '-457', '8', '3,012', '7', '309', '10', '-1', '-2,703', '23', '216',
                '1', '2', '1', '-22', '-214', '8', '1', '', '-8'
            ]
        },
        {
            id: 5,
            name: 'Бешбулок СИУ',
            vakil1: 'З.Бабаханов',
            vakil2: 'Туман ИИБ бошлиғи',
            values: [
                '105', '', '39', '37', '791', '66', '725', '24', '', '', '', '', '', '', '',
                '1,067', '7', '976', '92', '31', '', '4.1', '13', '28', '', '15.0',
                '54', '53', '942', '53', '1,013', '108', '', '71',
                '8', '61', '-18', '-5', '19', '', '9', '47', '6', '95', '', '', '',
                '-6', '-95', '12', '2,566', '8', '346', '13', '-4', '-2,221', '46',
                '750', '6', '47', '6', '-40', '-704', '10', '6', '1', '-9'
            ]
        },
        {
            id: 6,
            name: 'Саховат СИУ',
            vakil1: 'Ш.Каримқулов',
            vakil2: 'Туман Агроинспекция бўлими бошлиғи',
            values: [
                '', '', '', '', '240', '40', '200', '45', '', '15', '', '', '', '', '',
                '483', '', '385', '80', '5', '', '0.7', '14', '18', '', '10.0',
                '56', '9', '197', '9', '206', '105', '', , '6', '2',
                '51', '-5', '-2', '3', '', '', '', '2', '187', '', '', '', '-2',
                '-187', '10', '1,352', '6', '208', '15', '-4', '-1,144', '13', '213',
                '1', '47', '22', '-12', '-166', '2', '2', '', '-2'
            ]
        },
        {
            id: 7,
            name: 'Нурли йўл СИУ',
            vakil1: 'А.Мухамедов',
            vakil2: 'Туман "Сув етказиб бериш хизмати" ДМ директори',
            values: [
                '', '', '', '', '559', '23', '536', '51', '', '11', '', '', '', '', '',
                '688', '', '534', '78', '30', '', '3.1', '10', '20', '', '12.0',
                '60', '21', '414', '20', '396', '96', '-1', '12',
                '4', '62', '-14', '-3', '', '', '', '', '1', '28', '', '', '', '-1',
                '-28', '8', '2,112', '', '', '', '-8', '-2,112', '18', '312', '4',
                '94', '30', '-14', '-218', '1', '1', '', '-1'
            ]
        },
        {
            id: 8,
            name: 'Юксалиш СИУ',
            vakil1: 'С.Ўтбосаров',
            vakil2: 'Туман ҳокимининг ўринбосари',
            values: [
                '14', '', '', '', '1,033', '51', '982', '137', '', '', '', '', '', '', '',
                '1,424', '30', '1,225', '86', '39', '', '3.7', '9', '39', '',
                '31.3', '80', '27', '767', '25', '706', '92', '-2', '-61', '8', '57', '-18', '-6', '5', '', '1', '20', '5', '460', '', '',
                '', '-5', '-460', '12', '1,632', '5', '282', '17', '-7', '-1,351',
                '31', '527', '', '', '', '-31', '-527', '5', '1', '', '-5'
            ]
        },
        {
            id: 9,
            name: 'Дустлик СИУ',
            vakil1: 'Д.Сангиров',
            vakil2: 'Туман Прокурори',
            values: [
                '75', '', '36', '48', '862', '', '862', '329', '', '7', '', '', '', '', '',
                '1,215', '10', '1,112', '92', '19', '', '2.5', '13', '37', '',
                '29.1', '79', '40', '868', '40', '862', '99', '', '-6', '8', '59', '-17', '-6', '8', '', '2', '25', '11', '702', '', '',
                '', '-11', '-702', '17', '3,04', '10', '294', '10', '-7', '-2,746',
                '37', '964', '2', '18', '2', '-35', '-946', '11', '7', '', '-11'
            ]
        },
        {
            id: 10,
            name: 'Боғишамол СИУ',
            vakil1: 'Ф.Йўлдошов',
            vakil2: 'Туман Ветеринария бўлими бошлиғи',
            values: [
                '40', '', '', '', '1,29', '', '1,29', '490', '', '', '', '', '', '', '',
                '1,569', '10', '1,142', '73', '43', '', '1.4', '3', '27', '',
                '29.8', '110', '33', '492', '33', '522', '106', '', '31', '6', '48', '-17', '-7', '6', '', '', '', '3', '111', '', '', '',
                '-3', '-111', '9', '1,321', '3', '155', '12', '-6', '-1,167', '31',
                '281', '4', '43', '15', '-27', '-238', '7', '2', '', '-7'
            ]
        },
        {
            id: 11,
            name: 'Хосилобод СИУ',
            vakil1: 'О.Джураев',
            vakil2: 'Туман ҳокими',
            values: [
                '4', '', '4', '100', '619', '11', '608', '98', '', '', '', '', '', '', '',
                '896', '3', '888', '99', '34', '', '3.0', '9', '30', '', '22.9',
                '76', '34', '661', '31', '597', '90', '-3', '-63',
                '7', '69', '-14', '-3', '3', '', '', '', '4', '129', '', '', '', '-4',
                '-129', '10', '2,262', '8', '296', '13', '-2', '-1,967', '24', '566',
                '1', '17', '3', '-23', '-549', '5', '2', '', '-5'
            ]
        },
        {
            id: 12,
            name: 'Ишонч СИУ',
            vakil1: 'Б.Абдураимов',
            vakil2: 'Туман Агро банк филиали бошқарувчиси',
            values: [
                '', '', '', '', '557', '', '557', '', '', '', '', '', '', '', '',
                '751', '10', '571', '76', '14', '', '0.9', '6', '15', '', '8.0',
                '53', '5', '110', '5', '143', '131', '', '34', '3',
                '51', '-2', '-3', '2', '', '', '', '1', '57', '', '', '', '-1', '-57',
                '2', '452', '', '', '', '-2', '-452', '4', '203', '1', '18', '9',
                '-3', '-185', '', '', '1', '1'
            ]
        },
        {
            id: 13,
            name: 'Янги хаёт СИУ',
            vakil1: 'А.Қултоев',
            vakil2: 'Агросаноатни ривожлантириш вилоят бўлими бошлиғи',
            values: [
                '', '', '', '', '477', '', '477', '35', '', '42', '', '', '', '', '',
                '544', '10', '444', '81', '20', '', '0.8', '4', '12', '', '5.0',
                '42', '13', '215', '13', '215', '100', '', '', , '3',
                '56', '-2', '-2', '2', '', '', '', '1', '101', '', '', '', '-1',
                '-101', '3', '464', '', '', '', '-3', '-464', '11', '518', '4', '21',
                '4', '-7', '-497', '2', '', '', '-2'
            ]
        },
        {
            id: 14,
            name: 'Истиқлол СИУ',
            vakil1: 'З.Хамдамов',
            vakil2: 'Туман Халқ банки бошлиғи',
            values: [
                '6', '', '', '', '190', '', '190', '', '', '15', '', '', '', '', '',
                '340', '', '306', '90', '10', '', '1.0', '11', '6', '', '4.8',
                '79', '151', '56', '-1', '-119', '5', '4', '3',
                '2', '62', '-2', '-2', '2', '', '1', '50', '1', '1', '', '', '', '-1',
                '-1', '4', '984', '3', '89', '9', '-1', '-895', '6', '147', '', '',
                '', '-6', '-147', '6', '1', '', '-6'
            ]
        },
        {
            id: 15,
            name: 'Бошқа хўжаликлар',
            vakil1: '',
            vakil2: '',
            values: [
                '', '', '', '', '35', '', '35', '', '', '', '', '', '', '', '',
                '103', '', '93', '90', '', '', '', '', '', '', '', '', '1', '92',
                '1', '58', '63', '', '-34', '2', '2', '1', '1', '32', '-1', '-2', '',
                '', '', '', '', '', '', '', '', '', '', '', '1', '353', '', '', '',
                '-1', '-353', '', '', '', '', '', '', '',
            ]
        },
        {
            id: '',
            name: 'Туман жами',
            vakil1: '',
            vakil2: '',
            values: [
                '589', '', '144', '25', '8', '332', '7,668', '1,442', '', '99', '', '',
                '', '', '', '11,34', '90', '9,553', '84', '311', '', '26', '8',
                '326', '', '214', '66', '357', '7,766', '350', '7,717', '99', '-7',
                '-49', '69', '56', '-161', '-55', '64', '', '16',
                '25', '51', '2,969', '1', '16', '1', '-50', '-2,953', '121', '22,637',
                '73', '2,54', '11', '-48', '-20,098', '319', '6,616', '29', '434', '7',
                '-290', '-6,182', '71', '24', '3', '-68'
            ]
        }
    ];

    return (
        <div className="grid-container" dir="ltr">
            <div className="table-scroll-wrapper">
                <table className="waffle" cellSpacing="0" cellPadding="0">
                    <thead>
                        {/* Первая строка заголовков */}
                        <tr style={{ height: '20px' }}>
                            <td className="s0 sticky-col col1" rowSpan="3" style={{ left: '0px' }}>Т/р</td>
                            <td className="s0 sticky-col col2" rowSpan="3" style={{ left: '48px' }}>Худудлар номи</td>
                            <td className="s0 sticky-col col3" colSpan="2" rowSpan="3" style={{ left: '165px' }}>Бириктирилган вакил</td>
                            <td className="s1" colSpan="4">Ер ўзлаштириш</td>
                            <td className="s1" colSpan="11">Шинжон усулида томчилатиб</td>
                            <td className="s1" colSpan="4">Кузги шудгорлаш</td>
                            <td className="s1" colSpan="4">Ички ариқларни бетонлаштириш</td>
                            <td className="s1" colSpan="4">Ариқларни тозалаш <br /> (қўл кучида)</td>
                            <td className="s1" colSpan="7">Ғаллани суғориш <br /> 1-сув</td>
                            <td className="s1" colSpan="4">Пилла шртномасини тузиш</td>
                            <td className="s1" colSpan="4">Насосларга қуёш панели ўрнатиш</td>
                            <td className="s1" colSpan="7">Ғалла кредетидан қарздорлиги млн.сўм</td>
                            <td className="s1" colSpan="7">Пахта кредетидан қарздорлиги млн.сўм</td>
                            <td className="s1" colSpan="7">Сув солиғидан қарздорлик млн.сўм</td>
                            <td className="s1" colSpan="4">Судга бериш</td>
                        </tr>

                        {/* Вторая строка заголовков */}
                        <tr style={{ height: '20px' }}>
                            <td className="s0 !w-[200px]" rowSpan="2">Режа</td>
                            <td className="s0" colSpan="2">Амалда</td>
                            <td className="s0" rowSpan="2">Фоиз</td>
                            <td className="s0" rowSpan="2">Жами 2026 йил шинжон</td>
                            <td className="s0" rowSpan="2">2025 йилгача қилинган</td>
                            <td className="s0" rowSpan="2">2026 йилда режа</td>
                            <td className="s0" rowSpan="2">Ўз ҳисобидан қилина-диган майдон</td>
                            <td className="s0" colSpan="2">Сув кредитга ариза юбориш</td>
                            <td className="s0" colSpan="2">Молиялаш-тириш</td>
                            <td className="s0" colSpan="2">Амалда ишга туширилди</td>
                            <td className="s0" rowSpan="2">Фоиз</td>
                            <td className="s0" rowSpan="2">Режа</td>
                            <td className="s0" colSpan="2">Амалда</td>
                            <td className="s0" rowSpan="2">Фоиз</td>
                            <td className="s0" rowSpan="2">Режа</td>
                            <td className="s0" colSpan="2">Амалда</td>
                            <td className="s0" rowSpan="2">Фоиз</td>
                            <td className="s0" rowSpan="2">Режа</td>
                            <td className="s0" colSpan="2">Амалда</td>
                            <td className="s0" rowSpan="2">Фоиз</td>
                            <td className="s0" colSpan="2">Режа</td>
                            <td className="s0" colSpan="2">Амалда</td>
                            <td className="s0" rowSpan="2">%</td>
                            <td className="s0" colSpan="2">Фарқи,<br /> +,-</td>
                            <td className="s0" rowSpan="2">Режа</td>
                            <td className="s0" colSpan="2">Амалда</td>
                            <td className="s0" rowSpan="2">Фоиз</td>
                            <td className="s0" rowSpan="2">Режа</td>
                            <td className="s0" colSpan="2">Амалда</td>
                            <td className="s0" rowSpan="2">Фоиз</td>
                            <td className="s0" colSpan="2">Мавжуд қарздор-<br />лик</td>
                            <td className="s0" colSpan="2">Амалда сўндирилди</td>
                            <td className="s0" rowSpan="2">Фоиз</td>
                            <td className="s0" colSpan="2">Қолдиқ,<br /> +,-</td>
                            <td className="s0" colSpan="2">Мавжуд қарздор-<br />лик</td>
                            <td className="s0" colSpan="2">Амалда сўндирилди</td>
                            <td className="s0" rowSpan="2">Фоиз</td>
                            <td className="s0" colSpan="2">Қолдиқ,<br /> +,-</td>
                            <td className="s0" colSpan="2">Мавжуд</td>
                            <td className="s0" colSpan="2">Амалда тўланди</td>
                            <td className="s0" rowSpan="2">Фоиз</td>
                            <td className="s0" colSpan="2">Қолдиқ,<br /> +,-</td>
                            <td className="s0" rowSpan="2">Режа</td>
                            <td className="s0" rowSpan="2">Судга хужжат берилди</td>
                            <td className="s0" rowSpan="2">Суд қарори чиқа-рилди</td>
                            <td className="s0" rowSpan="2">Фарқи,<br /> +,-</td>
                        </tr>

                        {/* Третья строка заголовков */}
                        <tr style={{ height: '20px' }}>
                            <td className="s0">Бир кунда</td>
                            <td className="s0">Мавсум боши</td>
                            <td className="s0">Бир кунда</td>
                            <td className="s0">Мавсум боши</td>
                            <td className="s0">Бир кунда</td>
                            <td className="s0">Мавсум боши</td>
                            <td className="s0">Бир кунда</td>
                            <td className="s0">Мавсум боши</td>
                            <td className="s0">Бир <br /> кунда</td>
                            <td className="s0">Мавсум боши</td>
                            <td className="s0">Бир <br /> кунда</td>
                            <td className="s0">Мавсум боши</td>
                            <td className="s0">Бир <br /> кунда</td>
                            <td className="s0">Мавсум боши</td>
                            <td className="s0">ф/х <br /> сони</td>
                            <td className="s0">га</td>
                            <td className="s0">ф/х <br /> сони</td>
                            <td className="s0">га</td>
                            <td className="s0">ф/х <br /> сони</td>
                            <td className="s0">га</td>
                            <td className="s0">Бир кунда</td>
                            <td className="s0">Мавсум боши</td>
                            <td className="s0">Бир <br /> кунда</td>
                            <td className="s0">Мавсум боши</td>
                            <td className="s0">ф/х <br /> сони</td>
                            <td className="s0">сумма</td>
                            <td className="s0">ф/х <br /> сони</td>
                            <td className="s0">сумма</td>
                            <td className="s0">ф/х <br /> сони</td>
                            <td className="s0">сумма</td>
                            <td className="s0">ф/х <br /> сони</td>
                            <td className="s0">сумма</td>
                            <td className="s0">ф/х <br /> сони</td>
                            <td className="s0">сумма</td>
                            <td className="s0">ф/х <br /> сони</td>
                            <td className="s0">сумма</td>
                            <td className="s0">ф/х <br /> сони</td>
                            <td className="s0">сумма</td>
                            <td className="s0">ф/х <br /> сони</td>
                            <td className="s0">сумма</td>
                            <td className="s0">ф/х сони</td>
                            <td className="s0">сумма</td>
                        </tr>
                    </thead>

                    <tbody>
                        {data.map((row, rowIndex) => (
                            <tr key={rowIndex} style={{ height: '20px' }}>
                                <td
                                    className={`${row.id === 14 && rowIndex === data.length - 1 ? "s0" : "s2"} sticky-col col1`}
                                    style={{ left: '0px' }}

                                >
                                    {row.id}
                                </td>
                                <td
                                    className={`${row.id === 14 && rowIndex === data.length - 1 ? "s0" : "s3"} sticky-col col2`}
                                    style={{ left: '48px' }}

                                >
                                    {row.name}
                                </td>
                                <td
                                    className={`${row.id === 14 && rowIndex === data.length - 1 ? "s6" : "s3"} sticky-col col3`}
                                    style={{ left: '165px' }}

                                >
                                    {row.vakil1.includes('\n') ? (
                                        <>
                                            {row.vakil1.split('\n').map((line, i) => (
                                                <React.Fragment key={i}>
                                                    {line}
                                                    {i < row.vakil1.split('\n').length - 1 && <br />}
                                                </React.Fragment>
                                            ))}
                                        </>
                                    ) : (
                                        row.vakil1
                                    )}
                                </td>
                                <td
                                    className={`${row.id === 14 && rowIndex === data.length - 1 ? "s6" : "s3"} sticky-col col4`}
                                    style={{ left: '280px' }}

                                >
                                    {row.vakil2.includes('\n') ? (
                                        <>
                                            {row.vakil2.split('\n').map((line, i) => (
                                                <React.Fragment key={i}>
                                                    {line}
                                                    {i < row.vakil2.split('\n').length - 1 && <br />}
                                                </React.Fragment>
                                            ))}
                                        </>
                                    ) : (
                                        row.vakil2
                                    )}
                                </td>
                                {row.values.map((value, index) => (
                                    <td
                                        key={index}
                                        className={
                                            row.id === 14 && rowIndex === data.length - 1
                                                ? "s0"
                                                : "s2"
                                        }
                                    >
                                        {value}
                                    </td>
                                ))}
                            </tr>
                        ))}
                    </tbody>
                </table>
            </div>
        </div>
    );
}
