import React from 'react';

const Sayxun = () => {
    // Данные для таблицы
    const tableData = [
        {
            id: 1,
            region: "Фаровон",
            representativeName: "А.Раупов",
            representativePosition: "Туман бугалтеря \nмаркази дир-ри",
            values: [
                '', '', '', '', '644', '559', '84', '', '26', '61', '', '', '', '', '', '509', '', '302', '59', '5', '', '0.2', '4', '5', '', '5.4', '105', '7', '254', '7', '254', '100', '', '', '9', '5', '7', '3', '56', '-2', '-2', '4', '', '', '', '', '', '', '', '', '', '', '1', '154', '1', '38', '25', '', '-116', '3', '4', '1', '1', '33', '-2', '-3', '', '', '', '',
            ]
        },
        {
            id: 2,
            region: "Шурузук",
            representativeName: "Ф.Султонов",
            representativePosition: "“Оқолтин дон \n” АЖ раиси",
            values: [
                '103', '', '3', '3', '987', '342', '645', '22', '', '113', '', '29', '', '', '', '1,296', '', '928', '72', '11', '', '0.3', '2', '5', '', '6.0', '125', '16', '329', '16', '329', '100', '', '', '20', '7', '15', '4', '60', '-5', '-3', '4', '', '2', '50', '3', '67', '1', '11', '16', '-2', '-56', '5', '1,02', '2', '238', '23', '-3', '-782', '17', '399', '6', '32', '8', '-11', '-367', '1', '1', '', '-1'
            ]
        },
        {
            id: 3,
            region: "Пахтакор",
            representativeName: "Б.Курбанов",
            representativePosition: "Туман Прокурори",
            values: [
                '50', '', '8', '16', '777', '508', '268', '', '', '', '', '', '', '', '', '860', '', '697', '81', '33', '', '2.4', '7', '18', '', '18.9', '108', '18', '708', '18', '708', '100', '', '', '18', '8', '11', '5', '61', '-7', '-3', '2', '', '', '', '3', '410', '1', '133', '32', '-2', '-278', '8', '2,456', '2', '30', '1', '-6', '-2,426', '13', '401', '1', '1', '0', '-12', '-400', '1', '1', '1', ''
            ]
        },
        {
            id: 4,
            region: "Сайхун бахори",
            representativeName: "Қ.Ғиёсиддинов",
            representativePosition: "Туман Фермерлар\n кенгаши раиси",
            values: [
                '', '', '', '', '461', '19', '442', '', '', '27', '', '15', '', '', '', '868', '', '743', '86', '31', '', '0.3', '1', '9', '', '13.5', '147', '25', '1,064', '25', '1,017', '96', '', '-47', '27', '9', '16', '5', '61', '-11', '-3', '2', '', '', '', '6', '538', '1', '145', '27', '-5', '-393', '16', '6,061', '8', '545', '9', '-8', '-5,516', '24', '813', '1', '0', '0', '-23', '-813', '1', '1', '1', ''
            ]
        },
        {
            id: 5,
            region: "Ўзбекистон",
            representativeName: "Х.Қиличев",
            representativePosition: "Туман ҳокимининг ўринбосари",
            values: [
                '8', '', '8', '100', '1,362', '933', '429', '', '12', '52', '', '14', '', '', '', '952', '', '767', '81', '42', '', '1.0', '2', '15', '', '16.4', '112', '24', '614', '24', '614', '100', '', '', '27', '10', '19', '6', '61', '-8', '-4', '', '', '', '', '6', '560', '1', '57', '10', '-5', '-503', '13', '3,981', '8', '244', '6', '-5', '-3,736', '18', '320', '1', '1', '0', '-17', '-319', '', '', '', ''
            ]
        },
        {
            id: 6,
            region: "Бирлашган",
            representativeName: "Э.Муродқосимов",
            representativePosition: "Туман Аг-пекция\n бўлими бошлиғи",
            values: [
                '5', '', '5', '100', '194', '81', '157', '', '', '75', '', '15', '', '', '', '495', '', '491', '99', '27', '', '1.1', '4', '10', '', '11.3', '112', '17', '680', '17', '680', '100', '', '', '18', '6', '10', '3', '60', '-8', '-2', '5', '', '', '', '', '', '', '', '', '', '', '2', '801', '2', '184', '23', '', '-618', '8', '130', '6', '67', '52', '-2', '-62', '', '', '', ''
            ]
        },
        {
            id: 7,
            region: "Т.Ғуломов",
            representativeName: "А.Файзуллаев",
            representativePosition: "Туман ҚХБ \nбошлиғи ўринбосари",
            values: [
                '2', '', '2', '100', '527', '115', '412', '', '', '48', '', '', '', '', '', '652', '', '652', '100', '19', '', '0.7', '4', '10', '', '10.5', '103', '26', '555', '26', '555', '100', '', '', '24', '6', '19', '4', '66', '-5', '-2', '', '', '', '', '2', '230', '', '', '', '-2', '-230', '6', '657', '3', '99', '15', '-3', '-557', '19', '345', '2', '3', '1', '-17', '-342', '1', '1', '1', ''
            ]
        },
        {
            id: 8,
            region: "Қ.Султонов",
            representativeName: "Д.Очилов",
            representativePosition: "Туман Сув\n бўлими бошлиғи",
            values: [
                '16', '', '5', '32', '321', '', '321', '', '30', '54', '', '', '', '', '', '777', '', '748', '96', '19', '', '1.7', '9', '12', '', '13.2', '108', '40', '910', '40', '910', '100', '', '', '32', '8', '22', '5', '62', '-10', '-3', '6', '', '', '', '2', '49', '', '', '', '-2', '-49', '2', '141', '2', '127', '90', '', '-14', '16', '371', '4', '34', '9', '-12', '-337', '1', '1', '', '-1'
            ]
        },
        {
            id: 9,
            region: "Ш.Рахимов",
            representativeName: "К.Муллажанов",
            representativePosition: "Туман ҳокими",
            values: [
                '6', '', '1', '22', '265', '', '265', '', '30', '91', '', '36', '', '', '', '521', '', '516', '99', '17', '', '1.0', '6', '11', '', '15.4', '138', '39', '977', '39', '977', '100', '', '', '31', '7', '23', '5', '69', '-8', '-2', '4', '', '', '', '7', '295', '', '', '', '-7', '-295', '15', '1,927', '7', '144', '7', '-8', '-1,783', '25', '212', '2', '33', '15', '-23', '-179', '', '', '', ''
            ]
        },
        {
            id: 10,
            region: "Ғалаба",
            representativeName: "И.Абдуллаев",
            representativePosition: "Ўс-лар кар-ни ва\n ҳимояси бошқармаси бошлиғи",
            values: [
                '7', '', '', '', '226', '12', '214', '35', '', '', '', '', '', '', '', '607', '', '583', '96', '22', '', '1.6', '7', '10', '', '10.5', '108', '33', '861', '33', '833', '97', '', '-29', '25', '7', '8', '4', '52', '-17', '-3', '5', '', '7', '140', '8', '579', '', '', '', '-8', '-579', '10', '2,092', '2', '30', '1', '-8', '-2,062', '21', '451', '', '', '', '-21', '-451', '1', '1', '', '-1'
            ]
        },
        {
            id: 11,
            region: "К.Сохил",
            representativeName: "С.Хамидов",
            representativePosition: "Туман Агро\n банк бошқарувчиси",
            values: [
                '2', '', '', '', '15', '', '15', '', '', '', '', '', '', '', '', '359', '', '259', '72', '9', '', '0.8', '8', '8', '', '8.9', '108', '7', '217', '7', '198', '91', '', '-19', '10', '2', '', '1', '42', '-10', '-1', '', '', '2', '', '', '', '', '', '', '', '', '2', '557', '2', '28', '5', '', '-529', '4', '286', '', '', '', '-4', '-286', '1', '1', '1', ''
            ]
        },
        {
            id: 12,
            region: "А.Темур",
            representativeName: "Р.Умматқулов",
            representativePosition: "Туман ИИБ бошлиғи",
            values: [
                '12', '', '4', '31', '699', '263', '436', '', '33', '247', '', '', '', '', '', '881', '', '716', '81', '22', '', '0.8', '4', '17', '', '19.2', '111', '20', '761', '20', '761', '100', '', '', '15', '9', '10', '5', '56', '-5', '-4', '2', '', '', '', '7', '332', '', '', '', '-7', '-332', '8', '1,142', '3', '69', '6', '-5', '-1,073', '15', '209', '4', '40', '19', '-11', '-170', '1', '1', '1', ''
            ]
        },
        {
            id: 13,
            region: "Гулистон",
            representativeName: "А.Эштемиров\n У.Хамзаев",
            representativePosition: "Сирдарёсувқурилишинвест\n ДМ директори\n Туман Ветеринария ташҳис \n маркази директори",
            values: [
                '63', '', '2', '3', '650', '471', '179', '', '', '121', '', '', '', '', '', '1,344', '', '1,106', '82', '30', '', '5.0', '17', '16', '', '16.5', '102', '27', '921', '27', '916', '99', '', '-5', '35', '12', '21', '6', '48', '-14', '-6', '9', '', '2', '22', '2', '139', '', '', '', '-2', '-139', '5', '780', '2', '50', '6', '-3', '-730', '9', '107', '2', '2', '2', '-7', '-106', '2', '2', '2', ''
            ]
        },
        {
            id: 14,
            region: "Робот",
            representativeName: "Ш.Мухаммдов",
            representativePosition: "Туман Ветеринария \nбошлиғи",
            values: [
                '132', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '830', '', '453', '55', '5', '', '2.0', '38', '8', '', '7.7', '103', '10', '156', '10', '156', '100', '', '', '14', '6', '10', '3', '54', '-4', '-3', '3', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '3', '341', '1', '1', '0', '-2', '-339', '', '', '', '', ''
            ]
        },
        {
            id: 15,
            region: "Янгиобод",
            representativeName: "А.Мавлонов",
            representativePosition: "Туман ДСИ бошлиғи",
            values: [
                '251', '', '', '', '14', '', '14', '', '', '', '', '', '', '', '', '1,484', '', '1,178', '79', '56', '', '7.9', '14', '19', '', '18.8', '102', '72', '1,665', '72', '1,531', '92', '', '-133', '61', '14', '48', '10', '69', '-13', '-4', '3', '', '5', '167', '6', '338', '', '', '', '-6', '-338', '', '', '', '', '', '', '', '25', '491', '2', '18', '4', '-23', '-473', '', '', '', ''
            ]
        },
        {
            id: 16,
            region: "Бўстон",
            representativeName: "А.Ўсаров",
            representativePosition: "Туман ўс-лар ҳим-си \nва карантини бўлими бошлиғи",
            values: [
                '109', '', '', '', '859', '697', '162', '', '', '10', '', '10', '', '', '', '1,264', '', '711', '56', '16', '', '2.6', '16', '8', '', '9.0', '110', '25', '689', '25', '674', '98', '', '-15', '30', '9', '17', '5', '59', '-13', '-4', '6', '', '2', '33', '2', '127', '', '', '', '-2', '-127', '7', '658', '', '', '', '-7', '-658', '16', '597', '1', '1', '0', '-15', '-596', '3', '3', '', '-3'
            ]
        },
        {
            id: 17,
            region: "Жами",
            representativeName: "",
            representativePosition: "",
            values: [
                '766', '', '38', '5', '9', '4', '5', '57', '131', '900', '', '119', '', '', '', '13,7', '', '10,851', '79', '363', '', '29', '8', '180', '', '201', '112', '406', '11,361', '406', '11,113', '98', '', '-248', '396', '124', '256', '74', '59', '-140', '-50', '55', '', '20', '36', '54', '3,665', '4', '346', '9', '-50', '-3,319', '100', '22,426', '44', '1,825', '8', '-56', '-20,601', '236', '5,476', '34', '234', '4', '-202', '-5,242', '13', '13', '7', '-6'
            ]
        }
    ];

    return (
        <div className="grid-container" dir="ltr">
            <div className="table-scroll-wrapper">
                <table className="waffle" cellSpacing="0" cellPadding="0">
                    <thead>
                        {/* Первая строка заголовков */}
                        <tr style={{ height: '20px' }}>
                            <th className="s0 sticky-col col1" rowSpan="3" style={{ left: '0px' }}>Т/р</th>
                            <th className="s0 sticky-col col2" rowSpan="3" style={{ left: '48px' }}>
                                Ҳудудлар <br /> номи
                            </th>
                            <th className="s0 sticky-col col3" colSpan="2" rowSpan="2" style={{ left: '165px', top: '2px' }}>
                                Бириктирилган вакиллар
                            </th>
                            <th className="s1" colSpan="4">Ер ўзлаштириш</th>
                            <th className="s1" colSpan="11">Шинжон усулида</th>
                            <th className="s1" colSpan="4">Кузги шудгорлаш</th>
                            <th className="s1" colSpan="4">Ички ариқларни <br /> бетонлаштириш</th>
                            <th className="s1" colSpan="4">Ариқларни тозалаш <br /> (қўл кучида)</th>
                            <th className="s1" colSpan="7">Ғаллани суғориш <br /> 1-сув</th>
                            <th className="s1" colSpan="7">Пилла шартнома тузиш</th>
                            <th className="s1" colSpan="4">Насосларга қуёш панели ўрнатиш</th>
                            <th className="s1" colSpan="7">Ғалла кредетидан қарздорлиги млн.сўм</th>
                            <th className="s1" colSpan="7">Пахта кредетидан қарздорлиги млн.сўм</th>
                            <th className="s1" colSpan="7">Сув солиғидан қарздорлик млн.сўм</th>
                            <th className="s1" colSpan="4">Судга бериш</th>
                        </tr>

                        {/* Вторая строка заголовков */}
                        <tr style={{ height: '20px' }}>
                            <td className="s0" rowSpan="2">Режа</td>
                            <td className="s0" colSpan="2">Амалда</td>
                            <td className="s0" rowSpan="2">%</td>
                            <td className="s0" rowSpan="2">Жами <br /> 2026 йил шинжон</td>
                            <td className="s0" rowSpan="2">2025 йилгача қилинган</td>
                            <td className="s0" rowSpan="2">2026 йилда режа</td>
                            <td className="s0" rowSpan="2">Ўз ҳисобидан қилина-диган майдон</td>
                            <td className="s0" colSpan="2">Сув кредитга ариза юбориш</td>
                            <td className="s0" colSpan="2">Молия-лаштириш</td>
                            <td className="s0" colSpan="2">Амалда ишга туширилди</td>
                            <td className="s0" rowSpan="2">%</td>
                            <td className="s0" rowSpan="2">Режа</td>
                            <td className="s0" colSpan="2">Амалда</td>
                            <td className="s0" rowSpan="2">%</td>
                            <td className="s0" rowSpan="2">Режа</td>
                            <td className="s0" colSpan="2">Амалда</td>
                            <td className="s0" rowSpan="2">%</td>
                            <td className="s0" rowSpan="2">Режа</td>
                            <td className="s0" colSpan="2">Амалда</td>
                            <td className="s0" rowSpan="2">%</td>
                            <td className="s0" colSpan="2">Режа</td>
                            <td className="s0" colSpan="2">Амалда</td>
                            <td className="s0" rowSpan="2">%</td>
                            <td className="s0" colSpan="2">Фарқи,<br /> +,-</td>
                            <td className="s0" colSpan="2">Режа</td>
                            <td className="s0" colSpan="2">Амалда</td>
                            <td className="s0" rowSpan="2">%</td>
                            <td className="s0" colSpan="2">Фарқи,<br /> +,-</td>
                            <td className="s0" rowSpan="2">Режа,<br /> сони</td>
                            <td className="s0" colSpan="2">Амалда</td>
                            <td className="s0" rowSpan="2">%</td>
                            <td className="s0" colSpan="2">Мавжуд қарз</td>
                            <td className="s0" colSpan="2">Амалда сўндирилди</td>
                            <td className="s0" rowSpan="2">%</td>
                            <td className="s0" colSpan="2">Қолдиқ,<br /> +,-</td>
                            <td className="s0" colSpan="2">Мавжуд қарз</td>
                            <td className="s0" colSpan="2">Амалда сўндирилди</td>
                            <td className="s0" rowSpan="2">%</td>
                            <td className="s0" colSpan="2">Қолдиқ,<br /> +,-</td>
                            <td className="s0" colSpan="2">Мавжуд</td>
                            <td className="s0" colSpan="2">Амалда тўланди</td>
                            <td className="s0" rowSpan="2">%</td>
                            <td className="s0" colSpan="2">Қолдиқ,<br /> +,-</td>
                            <td className="s0" rowSpan="2">Режа</td>
                            <td className="s0" rowSpan="2">Судга хужжат берилди</td>
                            <td className="s0" rowSpan="2">Суд қарори чиқа-рилди</td>
                            <td className="s0" rowSpan="2">Фарқи,<br /> +,-</td>
                        </tr>

                        {/* Третья строка заголовков */}
                        <tr style={{ height: '20px' }}>
                            <td style={{ left: '165px' }} className="s0 sticky-col">Ф.И.Ш</td>
                            <td style={{ left: '295px' }} className="s0 sticky-col">Лавозими</td>
                            <td className="s0">Бир <br /> кунда</td>
                            <td className="s0">Мавсум боши</td>
                            <td className="s0">Бир <br /> кунда</td>
                            <td className="s0">Мавсум боши</td>
                            <td className="s0">Бир кунда</td>
                            <td className="s0">Мавсум боши</td>
                            <td className="s0">Бир <br /> кунда</td>
                            <td className="s0">Мавсум боши</td>
                            <td className="s0">Бир <br /> кунда</td>
                            <td className="s0">Мавсум <br /> боши</td>
                            <td className="s0">Бир <br /> кунда</td>
                            <td className="s0">Мавсум <br /> боши</td>
                            <td className="s0">Бир <br /> кунда</td>
                            <td className="s0">Мавсум <br /> боши</td>
                            <td className="s0">ф/х <br /> сони</td>
                            <td className="s0">га</td>
                            <td className="s0">ф/х <br /> сони</td>
                            <td className="s0">га</td>
                            <td className="s0">ф/х <br /> сони</td>
                            <td className="s0">га</td>
                            <td className="s0">ф/х <br /> сони</td>
                            <td className="s0">тн</td>
                            <td className="s0">ф/х <br /> сони</td>
                            <td className="s0">тн</td>
                            <td className="s0">ф/х <br /> сони</td>
                            <td className="s0">тн</td>
                            <td className="s0">Бир <br /> кунда</td>
                            <td className="s0">Мавсум боши</td>
                            <td className="s0">ф/х <br /> сони</td>
                            <td className="s0">сумма</td>
                            <td className="s0">ф/х <br /> сони</td>
                            <td className="s0">сумма</td>
                            <td className="s0">ф/х <br /> сони</td>
                            <td className="s0">сумма</td>
                            <td className="s0">ф/х <br /> сони</td>
                            <td className="s0">сумма</td>
                            <td className="s0">ф/х <br /> сони</td>
                            <td className="s0">сумма</td>
                            <td className="s0">ф/х <br /> сони</td>
                            <td className="s0">сумма</td>
                            <td className="s0">ф/х <br /> сони</td>
                            <td className="s0">сумма</td>
                            <td className="s0">ф/х <br /> сони</td>
                            <td className="s0">сумма</td>
                            <td className="s0">ф/х <br /> сони</td>
                            <td className="s0">сумма</td>
                        </tr>
                    </thead>


                    <tbody>
                        {tableData.map((row, rowIndex) => (
                            <tr
                                key={row.id}
                                style={{
                                    height: row.id === 18 ? '37px' :
                                        row.id === 6 ? '50px' :
                                            row.id === 7 || row.id === 9 || row.id === 10 ? '48px' :
                                                row.id === 5 ? '44px' :
                                                    row.id === 8 || row.id === 15 || row.id === 16 || row.id === 18 ? '46px' :
                                                        row.id === 3 || row.id === 13 || row.id === 14 || row.id === 16 ? '41px' :
                                                            row.id === 2 ? '38px' : '20px'
                                }}
                            >
                                <td
                                    className={`${row.isTotal ? "s0" : "s2"} sticky-col col1`}
                                    style={{ left: '0px' }}
                                    colSpan={row.isTotal ? 2 : 1}
                                >
                                    {row.isTotal ? "Жами" : row.id}
                                </td>

                                {!row.isTotal && (
                                    <td
                                        className={`${row.isTotal ? "s0" : "s3"} sticky-col col2`}
                                        style={{ left: '48px' }}
                                    >
                                        {row.region}
                                    </td>
                                )}

                                <td
                                    className={`${row.isTotal ? "s0" : "s2"} sticky-col col3`}
                                    style={{ left: row.isTotal ? '165px' : '165px' }}
                                >
                                    {row.representativeName}
                                </td>

                                <td
                                    className={`${row.isTotal ? "s0" : "s2"} sticky-col col4`}
                                    style={{ left: row.isTotal ? '295px' : '295px' }}
                                >
                                    {row.representativePosition.includes('\n') ? (
                                        <>
                                            {row.representativePosition.split('\n').map((line, i) => (
                                                <React.Fragment key={i}>
                                                    {line}
                                                    {i < row.representativePosition.split('\n').length - 1 && <br />}
                                                </React.Fragment>
                                            ))}
                                        </>
                                    ) : (
                                        row.representativePosition
                                    )}                                </td>

                                {row.values.map((value, index) => (
                                    <td
                                        key={index}
                                        className={row.isTotal ? "s6" : "s2"}
                                    >
                                        {value}
                                    </td>
                                ))}
                            </tr>
                        ))}
                    </tbody>
                </table>
            </div>
        </div>
    );
};

export default Sayxun;